[
  {
    "_id": "613f8896c1c0b3646447b0d5",
    "url": "https://remotive.io/remote-jobs/all-others/programme-office-specialists-886944",
    "title": "Programme Office Specialists",
    "company_name": "CYOS Solutions",
    "category": "All others",
    "job_type": "contract",
    "publication_date": "2021-09-11T02:32:56.000Z",
    "candidate_required_location": "Australia Only",
    "salary": "",
    "description": "<p><strong>Application closing date:</strong> Wednesday, 15 September 2021, 06:00 pm (in Canberra)</p>\n<p><strong>Estimated start date:</strong> Thu Sep 30 2021</p>\n<p><strong>Location of work:</strong> All States (remote work available)</p>\n<p><strong>Length of contract:</strong> 6 months</p>\n<p><strong>Contract extensions:</strong> 2x 6 months possible extensions</p>\n<p><strong>Security clearance:</strong> Must have current baseline clearance (Must be Australian Citizen)</p>\n<p><strong>Rates:</strong> $70 - $100 per hour (inc. super)</p>\n<p><br>Responsible for the establishment, management and delivery of a Portfolio/Programme office. Provide portfolio and programme assurance, including the development of relevant standards and processes to ensure that programmes of work are being successfully implemented within relevant constraints.<br><br><strong><br></strong><strong>Essential Criteria</strong></p>\n<ol>\n<li>Experience in Project and Programme Management offices, with demonstrated knowledge and experience in the P3O model, Prince/PMBOK or other Project management standard, and Managing Successful Programmes (MSP).</li>\n<li>Experience in developing, implementing and design programme management assurance processes and artefacts.</li>\n</ol>\n"
  },
  {
    "_id": "613f8896c1c0b3646447b0de",
    "url": "https://remotive.io/remote-jobs/data/data-engineer-885373",
    "title": "Data Engineer",
    "company_name": "Wurl",
    "category": "Data",
    "job_type": "",
    "publication_date": "2021-09-11T02:31:10.000Z",
    "candidate_required_location": "USA Only",
    "salary": "",
    "description": "<p><strong>About Wurl, Inc.</strong></p>\n<p>Since 2017, Wurl has been on a mission to make TV better for everyone. Today, Wurl is the world leader in powering streaming TV. Our video distribution and advertising services reach over 250 million connected TVs, delivering hundreds of millions of hours of TV viewing and millions of individually targeted ads. Wurl’s innovative, market-leading technologies enable content companies, streamers, and advertising to continually reach new viewers and grow revenue.</p>\n<p><br><strong>Data Engineer (Remote):</strong></p>\n<p>Wurl is seeking a detail-oriented data scientist/engineer with strong analytical and communication skills to join and grow with our data analytics team. Wurl collects data from a range of OTT video streaming ecosystem components. We digest it, analyze it, and present it. Join our team and help us with this very interesting data set!</p>\n<p> </p>\n<p><strong>Responsibilities:</strong></p>\n<ul>\n<li>Contribute to Wurl’s evolving ETL processes. </li>\n<li>Participate in managing the integrity of Wurl’s collected data: completeness, correctness, and cleanliness. </li>\n<li>Create and automate data validation processes.</li>\n<li>Create visualizations using BI and data visualizations tools to support internal and external customers.</li>\n<li>Interface with customers to explain usage and data anomalies. </li>\n<li>Interface with Engineering on data issues and pursue their recovery.</li>\n</ul>\n<p> </p>\n<p><strong>Requirements:</strong></p>\n<ul>\n<li>A Bachelors or Masters degree in Computer Science or Data Science. </li>\n<li>Strong SQL and Python skills. </li>\n<li>Knowledge of database design principles. </li>\n<li>Strong communication skills; team player with can-do attitude. </li>\n<li>Knowledge of agile methodologies and git source control</li>\n<li>Proficiency in written and verbal communications.</li>\n<li>Location: US Remote</li>\n</ul>\n<p> </p>\n<p><strong>A Plus if you have</strong>:</p>\n<p> </p>\n<ul>\n<li>Streaming video delivery experience.</li>\n<li>AWS Cloud experience.</li>\n<li>Knowledge of streaming video formats.</li>\n<li>Understanding of ETL processes.</li>\n<li>BI toolset experience.</li>\n<li>An interest in learning new things and sharing knowledge.</li>\n</ul>\n<p> </p>\n<p><strong>Physical Requirements:</strong></p>\n<ul>\n<li>Prolonged periods of sitting at a desk and working on a computer.</li>\n<li>Must be able to lift up to 15 pounds at times.</li>\n</ul>\n<p> </p>\n<p><strong>What We Offer</strong></p>\n<p>Wurl provides a competitive compensation and excellent benefits package including medical, dental, vision, life/disability insurance, 4 weeks of paid time off, 10 paid holidays, 401(k), flexible schedules and HSA. We are a fun, creative and collaborative remote work environment, headquartered in Palo Alto, CA. We live our values everyday in how we work with one another and support our clients. Wurl is truly a unique place to learn, create and have a daily impact on millions of people every day.  </p>\n<p><strong><em>Our promise to you</em></strong></p>\n<p>Few companies will allow you to thrive like you will at Wurl. You will have the opportunity to collaborate with the industry’s brightest minds and most innovative thinkers. You will enjoy ongoing mentorship, and you will understand what we mean by “human connection.” You will be proud to say you’re a part of the company revolutionizing TV.</p>\n"
  },
  {
    "_id": "613f8896c1c0b3646447b0ba",
    "url": "https://remotive.io/remote-jobs/finance-legal/claims-representative-pip-mpc-889450",
    "title": "Claims Representative - PIP/MPC",
    "company_name": "Metromile",
    "category": "Finance / Legal",
    "job_type": "",
    "publication_date": "2021-09-12T05:54:55.000Z",
    "candidate_required_location": "USA Only",
    "salary": "",
    "description": "<p><strong>About Us</strong> </p>\n<p>On the off chance you've thought about insurance, it's likely because you've insured something you love, not because you loved your insurance company. Metromile is out to change that. As an insurtech powered by data science and customer centric-design, we’re building a community of drivers who come for the savings and stay for the experience.</p>\n<p>With technology at its core, Metromile is reimagining insurance to make it fairer and actually delightful. We’re obsessed with savings, service, and features -- street sweeping alerts, monthly mileage summaries, fuel trackers and more -- that engage a customer all along their journey.  We’re on the forefront of disrupting a $250 billion auto insurance category that has gone unchanged for over 80 years. </p>\n<p>Metromile’s diverse team combines the best of Silicon Valley technologists with veterans from Fortune 500 insurers and financial services giants. This management structure ensures that the business is focused on growth, customer experience and technology innovation while also balancing unit economics and profitability. The team is growing quickly across its San Francisco, Tempe, and Boston offices. Our customer service, claims, and sales teams are all based in-house in the US.</p>\n<p><em>Thanks to what makes us different -- our people and our technology -- we’ve been honored with a slew of awards. A few recent ones include: named a Benzinga “Best Insurtech” finalist, a </em><a href=\"%22https:/www.azcentral.com/story/sponsor-story/top-companies-arizona-2020/2020/06/16/top-companies-work-arizona-2020/3201447001/%22\" rel=\"nofollow\"><em>Top Company to Work For</em></a><em>, one of the </em><a href=\"%22https:/www.bizjournals.com/phoenix/news/2020/08/24/phoenix-healthest-employers-honorees-2020-unveiled.html%22\" rel=\"nofollow\"><em>Healthiest Employers in Phoenix</em></a><em>, and a </em><a href=\"%22https:/www.bizjournals.com/phoenix/news/2019/12/13/best-places-to-work-2019winners-finalists-share.html?ana=knxv%22\" rel=\"nofollow\"><em>Best Place to Work</em></a><em>. And, </em><em>our CEO was recognized as a 2020 </em><a href=\"%22https:/www.bizjournals.com/sanfrancisco/news/2020/03/06/40-under-40-class-of-2020-dan-preston.html#:~:text=An experienced tech entrepreneur%2C Preston,chief technology officer for Metromile%22\" rel=\"nofollow\"><em>40 under 40</em></a><em>. </em></p>\n<p><strong>About the role   </strong></p>\n<p><strong>**This role can be 100% remote**</strong></p>\n<p>As a Personal Injury Protection (PIP) Claims Representative you will be directly involved in helping us create and develop our PIP handling guidelines.  You will also be responsible for investigating, evaluating, and resolving PIP claims including complex claims in multiple states.    </p>\n<p><strong>You will</strong></p>\n<ul>\n<li>Investigate, manages, evaluates and resolves claims assigned by Claims Team Manager. Evaluates medical necessity, subrogation potential and handle claims within prescribed authority.</li>\n<li>Communicates with policyholders, attorneys, medical providers, and managed care vendors in order to gather information regarding claims and refers tasks to third party vendors as necessary. Responds to various telephone and electronic communications .</li>\n<li>Reviews medical records and bills to verify claimed treatment is causally related to the accident and is reasonable and necessary given facts of the claim.</li>\n<li>Ensures adequacy of reserves and payment authority.</li>\n<li>Confirms or denies coverage and advises policyholders, attorneys and claimants as to proper course of action.</li>\n<li>Makes effective use of loss management techniques (IMEs, Nurse Review, and Bill Review). Negotiates settlements with attorneys, claimants, and medical providers. Arranges for expert inspections involving third party or potential fraud actions as needed.</li>\n<li>Updates files and provides comprehensive reports as required.</li>\n<li>Identifies and recommends referral of potentially fraudulent claims to the Special Investigation Unit.</li>\n<li>Recognizes continuous improvement opportunities and develops</li>\n</ul>\n<p> <strong>About you</strong></p>\n<ul>\n<li>4+ years of PIP experience from an auto insurance carrier</li>\n<li>Auto Managed Car/Provider network experience</li>\n<li>Excellent verbal and written communication skills</li>\n<li>Self-managed, highly motivated, and confident</li>\n<li>Able to work well under deadlines in a high-paced, changing environment</li>\n<li>Analytical mindset and problem-solving skills</li>\n<li>Attention to detail</li>\n<li>Bachelor’s Degree preferred but not required or equivalent experience required</li>\n</ul>\n<p><strong>What’s in it for you</strong></p>\n<ul>\n<li>Competitive salary </li>\n<li>Restricted stock units for every employee </li>\n<li>Excellent benefit package (health, dental, vision, 401K with match)</li>\n<li>Well-being reimbursement, includes home office equipment</li>\n<li>Flexible paid vacation program</li>\n<li>Flexible scheduling/hours                    </li>\n<li>Remote work options</li>\n<li>13 paid holidays - 2 of which are flex</li>\n<li>12 paid weeks of leave for child birth/adoption</li>\n<li>Annual anniversary gifts (5 yr. - 6 week paid sabbatical)</li>\n</ul>\n<p><strong><em>If you got to this point, we hope you're feeling excited about the role. Even if you don't feel that you meet every single requirement, we still encourage you to apply. We're eager to meet people that believe in Metromile’s mission and can contribute to our team in a variety of ways – not just candidates who check all the boxes.</em></strong></p>\n<p><strong><em>Metromile is committed to building a diverse, inclusive and equitable culture at all levels. We nurture a sense of community by investing in one another’s unique backgrounds and experiences to drive business success and positively influence our services and products.</em></strong></p>\n<p><strong><em>Metromile is proud to be an equal opportunity employer. We will not discriminate against any applicant or employee on the basis of age, race, color, ethnicity, national origin, citizenship, religion, creed, sex, sexual orientation, gender, gender identity or expression (including against any individual that is transitioning, has transitioned, or is perceived to be transitioning), marital status or civil partnership/union status, physical or mental disability, medical condition, pregnancy, childbirth, genetic information, military and veteran status, or any other basis prohibited by applicable federal, state or local law. </em></strong></p>\n<p><strong><em>If you are offered a position with Metromile, Inc. you will be required to successfully complete a background check. Metromile reserves the right to seek clarification of any alerts regarding your background check in order to confirm eligibility for employment.</em></strong></p>\n"
  },
  {
    "_id": "613f8896c1c0b3646447b0b4",
    "url": "https://remotive.io/remote-jobs/finance-legal/compliance-officer-889209",
    "title": "Compliance Officer",
    "company_name": "Antidote",
    "category": "Finance / Legal",
    "job_type": "full_time",
    "publication_date": "2021-09-12T14:06:28.000Z",
    "candidate_required_location": "UK Only",
    "salary": "",
    "description": "<p>Antidote is on a mission to disrupt the Medical Research space. We enable faster medical innovation, by transforming how patients and researchers connect.</p>\n<p>At our heart we are a digital patient engagement company, operating in the clinical trial recruitment sector. Our platform allows us to engage a wide network of patients and match them with the most relevant clinical trials accelerating the pace of medical research.</p>\n<p>We have gone from strength to strength and now have the momentum and resources to power our growth.</p>\n<p>We are a small but mighty team of ~45 professionals across our UK and US bases. Our teams are united by the purpose of our pioneering work in driving medical research and most importantly improving lives.</p>\n<p><strong>The Role </strong></p>\n<p>Due to the level of activity in the business, our Compliance Manager is seeking an experienced Compliance Officer to help deliver a busy and complex agenda.</p>\n<p>This is a newly created role and you will be responsible for applying best practice across the business that satisfies the quality, legal, security and assurance requirements of the business and our stakeholders.</p>\n<p>Day to day you will be working closely with our commercial teams across the business, but there will also be opportunity to liaise with our Executives and external clients in the healthcare/life sciences field.</p>\n<p><strong>Requirements</strong></p>\n<p>What we need from you</p>\n<ul>\n<li>We need someone who has demonstrable experience of running internal audits, from start to finish. At interview stage, we will want to understand your approach and the activities involved in running previous audits. Experience in CAPA tracking and reporting would be beneficial</li>\n<li>You will need to be able to show previous experience of drafting policies and procedures, providing compliance advice to business stakeholders and championing data privacy best practices. A solid understanding of the key principles of relevant information laws and regulations is required (GDPR and HIPAA)</li>\n<li>We need an individual who is comfortable to work independently and provides a seamless service to the commercial teams and our external clients when responding to audits and regulatory aspects of the RFP process.</li>\n<li>We work in a highly regulated industry, so it is important that you understand the need for tight controls and procedures and are able to assist with risk and privacy impact assessments. For this reason, our preference is for an individual who has experience in either the Pharmaceutical, Life Sciences or Clinical Trial industry</li>\n<li>Antidote is a relatively small company and we are scaling, so experience of working in a start-up environment where you can demonstrate that you have rolled your sleeves up, been proactive and managed your priorities and tasks effectively, would set you up for success in this role.</li>\n<li>Communication and relationship management is key in this role. We need someone who can demonstrate strength in their written and verbal communication, has a team player mentality and can talk us through how they have built solid relationships in the past.</li>\n</ul>\n<p><em>Our teams are located across European and US time zones (mostly East Coast) - previous experience working with US stakeholders is beneficial.</em></p>\n<p>What you will get from us</p>\n<ul>\n<li>This is a great opportunity for a competent Compliance Officer, who is keen to be part of a growing organisation and own part of the internal audit process</li>\n<li>You will get to work with some truly fantastic leaders and help the business mature it’s understanding of risk and controls.</li>\n<li>Whilst this is still a relatively junior role, the business is non-hierarchical and we think very much outside of a job description. As well as delivering on the key aspects of your role, as the business grows and as you settle into the role you will have opportunities to support our Compliance Manager on many other aspects of Risk, Audit and Compliance.</li>\n<li>We trust our employees to manage their own schedules as we are currently fully remote. What matters to us is output and being able to deliver high quality work on time and with accuracy -both for our internal stakeholders and our external clients.</li>\n<li>At Antidote, we pride ourselves on the great culture focused on collaboration and learning which we have organically fostered across our international UK and US bases.</li>\n</ul>\n<p><strong>Interview Process</strong></p>\n<p>We understand that your time is in demand so we have outlined the interview process below.</p>\n<ul>\n<li>Stage 1: Interview with the VP of People and our Compliance Manager. This will be an opportunity to explore your background and skills and assess motivation and fit with the business.</li>\n<li>Stage 2: A detailed competency based interview with our Compliance Manager to delve further into your experience and understand how you approach various situations similar to those you will find at Antidote.</li>\n</ul>\n<p>As a final step there may also be the opportunity for a brief conversation with our CFO as the Compliance team forms part of the Central function under his leadership.</p>\n<p><strong>Location</strong></p>\n<p>This role is currently remote, candidates should ideally be based within commuting distance to London to be able to attend in-person meetings with the team or the Compliance Manager. It is anticipated this will be once a week in the first month and then on as needed basis thereafter.</p>\n<p><strong>Benefits</strong></p>\n<ul>\n<li>Annual salary up to £40,000 (depending on experience)</li>\n<li>Pension</li>\n<li>Private medical insurance</li>\n<li>Life assurance</li>\n<li>Monthly wellbeing subsidy</li>\n<li>Remote working stipend and home set up allowance</li>\n<li>Stock options</li>\n<li>25 days holiday plus bank holidays (UK)</li>\n<li>Your birthday off</li>\n<li>Discretionary annual performance related bonus</li>\n</ul>\n<p><strong>Equal Opportunity</strong></p>\n<p>The best ideas are often the least expected and require new ways of thinking; that’s why our teams at Antidote are made up of an incredible range of talented people. Antidote is proud to be an equal opportunity employer. We do not discriminate based on race, ethnicity, color, ancestry, national origin, religion, sex, sexual orientation, gender identity, age, disability, veteran status, genetic information, marital status or any other legally protected status.</p>\n"
  },
  {
    "_id": "613f8896c1c0b3646447b0d4",
    "url": "https://remotive.io/remote-jobs/product/product-owner-anz-892457",
    "title": "Product Owner (ANZ)",
    "company_name": "Live Graphic Systems Pty Ltd",
    "category": "Product",
    "job_type": "full_time",
    "publication_date": "2021-09-11T06:18:41.000Z",
    "candidate_required_location": "Australia & New Zealand",
    "salary": "",
    "description": "<p class=\"description\" style=\"margin: 0px 0px 40px; padding: 0px; border-style: initial; font-variant-numeric: inherit; font-variant-east-asian: inherit; font-stretch: inherit; line-height: inherit; font-family: PFDinTextPro-Regular; vertical-align: baseline; width: 550px; color: #939393; letter-spacing: 0.5px;\"> </p>\n<p style=\"margin-bottom: 20px; padding: 0px; border-style: initial; font-style: inherit; font-variant: inherit; font-stretch: inherit; line-height: 1.7; vertical-align: baseline; text-rendering: optimizelegibility;\"><span style=\"font-weight: 600; margin: 0px; padding: 0px; border-style: initial; font-style: inherit; font-variant: inherit; font-stretch: inherit; line-height: inherit; font-family: PFDinTextCondPro-Medium; vertical-align: baseline; color: #181818;\">Product Owner<br></span>Open to candidates based within 3 hours of Sydney, Australia’s timezone (AEST/AEDT).</p>\n<p style=\"margin-bottom: 20px; padding: 0px; border-style: initial; font-style: inherit; font-variant: inherit; font-stretch: inherit; line-height: 1.7; vertical-align: baseline; text-rendering: optimizelegibility;\"><span style=\"font-weight: 600; margin: 0px; padding: 0px; border-style: initial; font-style: inherit; font-variant: inherit; font-stretch: inherit; line-height: inherit; font-family: PFDinTextCondPro-Medium; vertical-align: baseline; color: #181818;\">What is LIGR?</span><br>LIGR.Live, our cloud-based plug and play sports broadcast platform, has completely transformed the livestream sports landscape and made it possible for more than 1,000 sports organisations in 80 countries to self-produce their live sport. Our customers love LIGR.Live because they can add stunning TV-quality animated graphics to their livestreams or broadcasts in a matter of minutes – but we are much more than a simple graphics platform.</p>\n<p style=\"margin-bottom: 20px; padding: 0px; border-style: initial; font-style: inherit; font-variant: inherit; font-stretch: inherit; line-height: 1.7; vertical-align: baseline; text-rendering: optimizelegibility;\">LIGR is the only all-in-one sports broadcast solution. Our users can access powerful automation and collaboration tools, live scoring and in-game stats, fixture and asset management, integrated sponsorship and advertising, and built-in tracking and reporting. We’re also working on more exciting features, such as video mixing and production, automatic replays, automatic social posts, and more advanced advertising tools for sports sponsors.</p>\n<p style=\"margin-bottom: 20px; padding: 0px; border-style: initial; font-style: inherit; font-variant: inherit; font-stretch: inherit; line-height: 1.7; vertical-align: baseline; text-rendering: optimizelegibility;\">LIGR is VC funded and backed by prominent angel investors. We are growing fast and looking for talented, self-motivated people to join our team who value collaboration, growth and learning.</p>\n<p> </p>\n<p style=\"margin-bottom: 20px; padding: 0px; border-style: initial; font-style: inherit; font-variant: inherit; font-stretch: inherit; line-height: 1.7; vertical-align: baseline; text-rendering: optimizelegibility;\"><span style=\"font-weight: 600; margin: 0px; padding: 0px; border-style: initial; font-style: inherit; font-variant: inherit; font-stretch: inherit; line-height: inherit; font-family: PFDinTextCondPro-Medium; vertical-align: baseline; color: #181818;\">What’s the role?</span></p>\n<p style=\"margin-bottom: 20px; padding: 0px; border-style: initial; font-style: inherit; font-variant: inherit; font-stretch: inherit; line-height: 1.7; vertical-align: baseline; text-rendering: optimizelegibility;\">Over the next 12 months and beyond, LIGR will be embarking on an ambitious product development journey, with a plethora of new features planned to be built and delivered to continue our promise of being the only all-in-one sports broadcast solution. As a Product Owner, you will be crucial to executing these plans, and we are on the hunt for the right individual to join us in embarking on this next phase of product development.</p>\n<p style=\"margin-bottom: 20px; padding: 0px; border-style: initial; font-style: inherit; font-variant: inherit; font-stretch: inherit; line-height: 1.7; vertical-align: baseline; text-rendering: optimizelegibility;\">Your focus will be our users, working from real-world problems to create solutions that meet our customers’ needs. You will work cross-functionally to guide products and features from conception to launch by connecting the technical, customer and business worlds. You should be able to break down complex problems into steps that drive product development.</p>\n<p> </p>\n<p style=\"margin-bottom: 20px; padding: 0px; border-style: initial; font-style: inherit; font-variant: inherit; font-stretch: inherit; line-height: 1.7; vertical-align: baseline; text-rendering: optimizelegibility;\"><span style=\"font-weight: 600; margin: 0px; padding: 0px; border-style: initial; font-style: inherit; font-variant: inherit; font-stretch: inherit; line-height: inherit; font-family: PFDinTextCondPro-Medium; vertical-align: baseline; color: #181818;\">Responsibilities:</span></p>\n<ul style=\"margin-bottom: 40px; margin-left: 20px; padding-left: 0px; border-style: initial; font-style: inherit; font-variant: inherit; font-stretch: inherit; line-height: inherit; vertical-align: baseline;\">\n<li style=\"margin: 0px 0px 10px; padding: 0px; border-style: initial; font-style: inherit; font-variant: inherit; font-stretch: inherit; line-height: 1.7; font-family: inherit; vertical-align: baseline;\">Develop and deliver on product roadmaps that align with LIGR’s vision, product strategy and commercial targets.</li>\n<li style=\"margin: 0px 0px 10px; padding: 0px; border-style: initial; font-style: inherit; font-variant: inherit; font-stretch: inherit; line-height: 1.7; font-family: inherit; vertical-align: baseline;\">Write stories, development briefs, acceptance criteria, and define test cases.</li>\n<li style=\"margin: 0px 0px 10px; padding: 0px; border-style: initial; font-style: inherit; font-variant: inherit; font-stretch: inherit; line-height: 1.7; font-family: inherit; vertical-align: baseline;\">Be an expert on our target users, how they interact with our product, and how they use alternative products through research, market analysis, data and customer feedback.</li>\n<li style=\"margin: 0px 0px 10px; padding: 0px; border-style: initial; font-style: inherit; font-variant: inherit; font-stretch: inherit; line-height: 1.7; font-family: inherit; vertical-align: baseline;\">Speak with customers one-on-one to understand their feedback and use this information in planning, designing, and implementing new features.</li>\n<li style=\"margin: 0px 0px 10px; padding: 0px; border-style: initial; font-style: inherit; font-variant: inherit; font-stretch: inherit; line-height: 1.7; font-family: inherit; vertical-align: baseline;\">Assist in the production of concise internal documentation and help centre articles for customers.</li>\n<li style=\"margin: 0px 0px 10px; padding: 0px; border-style: initial; font-style: inherit; font-variant: inherit; font-stretch: inherit; line-height: 1.7; font-family: inherit; vertical-align: baseline;\">Setup and manage procedures and systems for tracking and managing sprints, backlog and roadmaps.</li>\n<li style=\"margin: 0px 0px 10px; padding: 0px; border-style: initial; font-style: inherit; font-variant: inherit; font-stretch: inherit; line-height: 1.7; font-family: inherit; vertical-align: baseline;\">Ruthlessly prioritise, coordinate delivery schedules and ensure consensus.</li>\n<li style=\"margin: 0px 0px 10px; padding: 0px; border-style: initial; font-style: inherit; font-variant: inherit; font-stretch: inherit; line-height: 1.7; font-family: inherit; vertical-align: baseline;\">Scope and manage planned, existing, or ongoing major and minor product releases.</li>\n<li style=\"margin: 0px 0px 10px; padding: 0px; border-style: initial; font-style: inherit; font-variant: inherit; font-stretch: inherit; line-height: 1.7; font-family: inherit; vertical-align: baseline;\">Work with marketing and creative to produce relevant content showcasing the product and new features.</li>\n<li style=\"margin: 0px 0px 10px; padding: 0px; border-style: initial; font-style: inherit; font-variant: inherit; font-stretch: inherit; line-height: 1.7; font-family: inherit; vertical-align: baseline;\">Act as a scrum master with the engineering team - planning deployments and discussing blockers with engineering throughout the workday.</li>\n</ul>\n<p style=\"margin-bottom: 20px; padding: 0px; border-style: initial; font-style: inherit; font-variant: inherit; font-stretch: inherit; line-height: 1.7; vertical-align: baseline; text-rendering: optimizelegibility;\"><span style=\"font-weight: 600; margin: 0px; padding: 0px; border-style: initial; font-style: inherit; font-variant: inherit; font-stretch: inherit; line-height: inherit; font-family: PFDinTextCondPro-Medium; vertical-align: baseline; color: #181818;\">The ideal candidate will possess:</span></p>\n<ul style=\"margin-bottom: 40px; margin-left: 20px; padding-left: 0px; border-style: initial; font-style: inherit; font-variant: inherit; font-stretch: inherit; line-height: inherit; vertical-align: baseline;\">\n<li style=\"margin: 0px 0px 10px; padding: 0px; border-style: initial; font-style: inherit; font-variant: inherit; font-stretch: inherit; line-height: 1.7; font-family: inherit; vertical-align: baseline;\">Experience as a product owner or manager on a SaaS product or other product related to sports technology or broadcast technology.</li>\n<li style=\"margin: 0px 0px 10px; padding: 0px; border-style: initial; font-style: inherit; font-variant: inherit; font-stretch: inherit; line-height: 1.7; font-family: inherit; vertical-align: baseline;\">You have strong interpersonal skills, and a strategic mindset, with the ability to communicate vision and manage diverse stakeholders.</li>\n<li style=\"margin: 0px 0px 10px; padding: 0px; border-style: initial; font-style: inherit; font-variant: inherit; font-stretch: inherit; line-height: 1.7; font-family: inherit; vertical-align: baseline;\">Understand the balance between quality and getting things done.</li>\n<li style=\"margin: 0px 0px 10px; padding: 0px; border-style: initial; font-style: inherit; font-variant: inherit; font-stretch: inherit; line-height: 1.7; font-family: inherit; vertical-align: baseline;\">Experience creating product roadmaps and working with cross-functional teams.</li>\n<li style=\"margin: 0px 0px 10px; padding: 0px; border-style: initial; font-style: inherit; font-variant: inherit; font-stretch: inherit; line-height: 1.7; font-family: inherit; vertical-align: baseline;\">You have a strong UX mindset with an appreciation for seamless, simple design – and a ruthless passion for protecting it.</li>\n<li style=\"margin: 0px 0px 10px; padding: 0px; border-style: initial; font-style: inherit; font-variant: inherit; font-stretch: inherit; line-height: 1.7; font-family: inherit; vertical-align: baseline;\">You have a technical background, can speak an engineer’s language, and can understand the trade-offs.</li>\n<li style=\"margin: 0px 0px 10px; padding: 0px; border-style: initial; font-style: inherit; font-variant: inherit; font-stretch: inherit; line-height: 1.7; font-family: inherit; vertical-align: baseline;\">Can demonstrate your understanding of agile methodologies, requirements gathering, prioritisation, identifying and addressing constraints, dependencies and risks.</li>\n<li style=\"margin: 0px 0px 10px; padding: 0px; border-style: initial; font-style: inherit; font-variant: inherit; font-stretch: inherit; line-height: 1.7; font-family: inherit; vertical-align: baseline;\">You have experience in delivering data and insights-based products.</li>\n<li style=\"margin: 0px 0px 10px; padding: 0px; border-style: initial; font-style: inherit; font-variant: inherit; font-stretch: inherit; line-height: 1.7; font-family: inherit; vertical-align: baseline;\">You are customer-centric and can balance customer satisfaction as well as the commercial outcome.</li>\n<li style=\"margin: 0px 0px 10px; padding: 0px; border-style: initial; font-style: inherit; font-variant: inherit; font-stretch: inherit; line-height: 1.7; font-family: inherit; vertical-align: baseline;\">You use analytics and data-driven measurement to inform decision making.</li>\n<li style=\"margin: 0px 0px 10px; padding: 0px; border-style: initial; font-style: inherit; font-variant: inherit; font-stretch: inherit; line-height: 1.7; font-family: inherit; vertical-align: baseline;\">You are customer driven and have a passion for speaking directly to customers.</li>\n</ul>\n<p style=\"margin-bottom: 20px; padding: 0px; border-style: initial; font-style: inherit; font-variant: inherit; font-stretch: inherit; line-height: 1.7; vertical-align: baseline; text-rendering: optimizelegibility;\"><span style=\"font-weight: 600; margin: 0px; padding: 0px; border-style: initial; font-style: inherit; font-variant: inherit; font-stretch: inherit; line-height: inherit; font-family: PFDinTextCondPro-Medium; vertical-align: baseline; color: #181818;\">Desirable attributes (non-essential):</span></p>\n<ul style=\"margin-bottom: 40px; margin-left: 20px; padding-left: 0px; border-style: initial; font-style: inherit; font-variant: inherit; font-stretch: inherit; line-height: inherit; vertical-align: baseline;\">\n<li style=\"margin: 0px 0px 10px; padding: 0px; border-style: initial; font-style: inherit; font-variant: inherit; font-stretch: inherit; line-height: 1.7; font-family: inherit; vertical-align: baseline;\">A basic understanding of live video production and accompanying technologies</li>\n<li style=\"margin: 0px 0px 10px; padding: 0px; border-style: initial; font-style: inherit; font-variant: inherit; font-stretch: inherit; line-height: 1.7; font-family: inherit; vertical-align: baseline;\">A background in engineering or product design</li>\n<li style=\"margin: 0px 0px 10px; padding: 0px; border-style: initial; font-style: inherit; font-variant: inherit; font-stretch: inherit; line-height: 1.7; font-family: inherit; vertical-align: baseline;\">A general understanding of sports and/or broadcast</li>\n</ul>\n<p style=\"margin-bottom: 20px; padding: 0px; border-style: initial; font-style: inherit; font-variant: inherit; font-stretch: inherit; line-height: 1.7; vertical-align: baseline; text-rendering: optimizelegibility;\"><br><span style=\"font-weight: 600; margin: 0px; padding: 0px; border-style: initial; font-style: inherit; font-variant: inherit; font-stretch: inherit; line-height: inherit; font-family: PFDinTextCondPro-Medium; vertical-align: baseline; color: #181818;\">Benefits</span><br>In addition to being a part of a great team, working in a fun, creative environment and learning from the best technical minds in the sports industry, we offer:</p>\n<ul style=\"margin-bottom: 40px; margin-left: 20px; padding-left: 0px; border-style: initial; font-style: inherit; font-variant: inherit; font-stretch: inherit; line-height: inherit; vertical-align: baseline;\">\n<li style=\"margin: 0px 0px 10px; padding: 0px; border-style: initial; font-style: inherit; font-variant: inherit; font-stretch: inherit; line-height: 1.7; font-family: inherit; vertical-align: baseline;\">A competitive salary + ESOP (depending on experience)</li>\n<li style=\"margin: 0px 0px 10px; padding: 0px; border-style: initial; font-style: inherit; font-variant: inherit; font-stretch: inherit; line-height: 1.7; font-family: inherit; vertical-align: baseline;\">The chance to work with global sporting bodies, sports leagues, sportscasters and broadcasters</li>\n<li style=\"margin: 0px 0px 10px; padding: 0px; border-style: initial; font-style: inherit; font-variant: inherit; font-stretch: inherit; line-height: 1.7; font-family: inherit; vertical-align: baseline;\">Remote work</li>\n<li style=\"margin: 0px 0px 10px; padding: 0px; border-style: initial; font-style: inherit; font-variant: inherit; font-stretch: inherit; line-height: 1.7; font-family: inherit; vertical-align: baseline;\">A role at a start-up sized company, where you can make an immediate impact</li>\n</ul>\n<p style=\"margin-bottom: 20px; padding: 0px; border-style: initial; font-style: inherit; font-variant: inherit; font-stretch: inherit; line-height: 1.7; vertical-align: baseline; text-rendering: optimizelegibility;\"><br>If you’ve got what it takes, we want to hear from you!</p>\n<p class=\"apply-container\" style=\"margin: 0px; padding: 0px; border-style: initial; font-variant-numeric: inherit; font-variant-east-asian: inherit; font-stretch: inherit; line-height: inherit; font-family: Roboto, HelveticaNeue-Light, 'Helvetica Neue Light', 'Helvetica Neue', Helvetica, Arial, sans-serif; vertical-align: baseline; color: #333333; letter-spacing: 0.5px;\"> </p>\n"
  },
  {
    "_id": "613f8896c1c0b3646447b0c6",
    "url": "https://remotive.io/remote-jobs/marketing/marketing-manager-890919",
    "title": "Marketing Manager",
    "company_name": "Rare Edition",
    "category": "Marketing",
    "job_type": "full_time",
    "publication_date": "2021-09-12T05:52:54.000Z",
    "candidate_required_location": "USA Only",
    "salary": "",
    "description": "<div class=\"h3\">About Rare Edition:</div>\n<p>Rare Edition is a stealth startup in the collectibles space that is \n                    built by lifelong collectors, impassioned technologists, and seasoned \n                    operators. For decades, this industry was considered a mere childhood \n                    hobby, but in just a few short years, forgotten shoeboxes turned into \n                    treasure troves and this pastime matured into investments. This rapid \n                    shift has outpaced the infrastructure of the existing companies, and in \n                    their scramble to catch up, they've taken their customers for granted \n                    and failed to serve their loyal collectors. The stage is set for someone\n                     to raise the bar for the entire ecosystem and deliver the quality of \n                    service that is expected and deserved. </p>\n<p>With the support of Craft Ventures, Jason Calacanis, and other \n                    celebrity investors, Rare Edition has mapped out a plan to truly rewrite\n                     the fabric of this industry. We're starting first with sports and \n                    trading cards and rare coins, and we've carefully considered how to \n                    reimagine the entire collectible-lifecycle—from software to hardware \n                    solutions, physical to digital ownership, and first-time to professional\n                     collectors—leaving no stone unturned. We're a team that values \n                    relentless execution, fearless accountability, leaving a lasting impact \n                    in this space, and exceeding our customer's expectations. If you're a \n                    collector-veteran or just want to join a company with all the cards \n                    stacked in its favor, come and drop us a line.</p>\n<div class=\"h3\">About the role:</div>\n<p>We're seeking an experienced Marketing Manager to join as our first \n                    Marketing hire. This role is not for the faint of heart as our business \n                    is complex and our offering is a multi-layered vertical solution that \n                    spans the physical to the digital. We're in a crowded space with \n                    confusing messages from competitors, and the central charge is to cut \n                    through that noise and establish a new globally recognized brand. We're \n                    fanatical about delivering a product and service experience that exceeds\n                     anything the industry has seen and pushes the limits of even what our \n                    customers might imagine. We're looking for someone who's ready to drum \n                    up a marketing storm equal to that ambition. We're a small but \n                    formidable team right now, and we're looking for individuals who seek \n                    both a new home for their genius and a new challenge for their career. </p>\n<div class=\"h3\">Our expectations for you include:</div>\n<p>• <strong>Wear many hats</strong>. Everyone on our small team eagerly\n                     seeks out ways to fill in any gaps they find and, as our first \n                    Marketing hire, willingness to do this is essential. This role will span\n                     across brand, product, content, digital/SM, paid, guerilla, podcast, \n                    partner, research, and more! In fact, our imminent launch to the public \n                    is your moment to shine.<br>\n                    • <strong>Own the brand</strong>. This isn't just another job and you \n                    are not just a cog. You are here to help establish and propel our name \n                    and message stratospheric, and everything you do is done with this in \n                    mind. This can be seen in how you manage our Rare Edition social media \n                    presences, drive engagement through conversations and testing, \n                    coordinate a strategic content and podcast roadmap, and help position \n                    the product for maximum alignment with our brand.<br>\n                    • <strong>Over communicate</strong>. Whether for deep-dive discussions \n                    with other leaders, iterative exploration with designers, or road \n                    mapping with the executive team, clarity, proactiveness, and active \n                    listening are your mainstays.<br>\n                    • <strong>Organize and plan</strong>. Your ability to reason and \n                    orchestrate on the granular, campaign level and on the strategic, macro \n                    level while considering short-term and long-term implications will \n                    certainly be tested. <br>\n                    • <strong>Ask and analyze</strong>. Your intuition will be a guiding \n                    force but your curiosity is only satiated with thorough, data-driven \n                    research, experimentation, and reasoning.<br>\n                    • <strong>Fear only stagnation</strong>. From cross-functional \n                    collaboration to planning and execution, there is never any waiting \n                    around. You are the solution to the questions and problems you find.<br>\n                    • <strong>Want to grow</strong>. You see all your peers as your teachers\n                     and never shy away from a challenge or learning opportunity. And \n                    finding chances to coach and teach is exhilarating.<br>\n                    • <strong>Be a servant leader</strong>. Your proven track record in \n                    defining and driving marketing and brand strategies may be impressive, \n                    but your leadership mentality is what everyone remembers you by.<br>\n                    • <strong>Scale to success</strong>. You see the clearest path to \n                    helping you and Rare Edition succeed is to build and mentor a scalable \n                    team that makes your current job obsolete.</p>\n<div class=\"h3\">About our perks:</div>\n<p>• Autonomy to explore and do your best work<br>\n                    • Competitive salaries and an employee-friendly equity plan<br>\n                    • Flexible vacation policy and other benefits<br>\n                    • Remote or on-site working arrangements<br>\n                    • Mentorship designed to help your professional career<br>\n                    • Unbounded growth opportunities and a seat on this  to the </p>\n"
  },
  {
    "_id": "613f8896c1c0b3646447b0cd",
    "url": "https://remotive.io/remote-jobs/customer-support/customer-service-analyst-886014",
    "title": "Customer Service Analyst",
    "company_name": "Experian",
    "category": "Customer Service",
    "job_type": "full_time",
    "publication_date": "2021-09-12T05:51:38.000Z",
    "candidate_required_location": "USA Only",
    "salary": "",
    "description": "<div class=\"h3\">Company Description</div>\n<p>At Experian Health, our employees can shape more than products – they shape the future of U.S. healthcare. Experian Health is a pioneer for innovations leading the way in revenue cycle management, identity management, patient engagement, and care management for hospitals, physician groups, labs, pharmacies and other risk-bearing entities. Our success relies on people who are given the freedom to imagine new frontiers in the rapidly changing healthcare space and push the boundaries of innovation. Help us realize our vision of applying data for good and changing the healthcare landscape for the better – for all of us.</p>\n<p><br><br></p>\n<div class=\"h3\">Job Description</div>\n<p>We are experiencing significant growth and is seeking a talented, passion-driven individual to enhance the talent and of our development team. This position will be responsible for supporting clients using two different Experian Health revenue cycle products.</p>\n<p>What you’ll be doing:</p>\n<ul>\n<li>Analyzing and facilitating the resolution of complex client issues for multiple products</li>\n<li>Partnering with the relationship management, engineering, and product management teams to facilitate prompt resolution of client issues</li>\n<li>Attending and participating in internal and client meetings</li>\n<li>Consistently communicating with clients to answer questions and provide case status updates</li>\n<li>Working collaboratively with teammates and product adjacent teams to resolve issues in a timely manner</li>\n</ul>\n<p><br><br></p>\n<div class=\"h3\">Qualifications</div>\n<ul>\n<li>Bachelor’s degree or greater in related field, or equivalent education and experience </li>\n<li>Minimum 3 years’ experience working in the healthcare industry with familiarity of the healthcare revenue cycle, medical billing, or 835 or 837 and X12 or HL7 experience a plus.</li>\n<li>Must have superior analytical and problem-solving skills</li>\n<li>Must possess exceptional customer service skills and be able to work in a fast-paced environment with high client expectations</li>\n<li>Must be flexible and able to adapt quickly to product and process changes </li>\n<li>Should have excellent interpersonal and communication skills are essential</li>\n<li>Must be able to handle multiple tasks, take initiative, and prioritize</li>\n<li>Should be detail oriented</li>\n<li>Must be able to work productively in a remote environment</li>\n</ul>\n<p><br><br></p>\n<div class=\"h3\">Additional Information</div>\n<p>All your information will be kept confidential according to EEO guidelines. Experian is proud to be an Equal Opportunity and Affirmative Action employer. Our goal is to create a thriving, inclusive and diverse team where people love their work and love working together. We believe that diversity, equity and inclusion is essential to our purpose of creating a better tomorrow. We value the uniqueness of every individual and want you to bring your whole, authentic self to work. For us, this is The Power of YOU and it ensures that we live what we believe.</p>\n<div> </div>\n<p><em>Experian is proud to be an Equal Opportunity and Affirmative Action employer. Our goal is to create a thriving, inclusive and diverse team where people love their work and love working together. We believe that diversity, equity and inclusion is essential to our purpose of creating a better tomorrow. We value the uniqueness of every individual and want you to bring your whole, authentic self to work. For us, this is <a href=\"https://www.flipsnack.com/79B9EDC8B7A/the-power-of-you-report-external-2020/full-view.html\" rel=\"nofollow\">The Power of YOU</a> and it ensures that we live what we believe.</em></p>\n"
  },
  {
    "_id": "613f8896c1c0b3646447b0cf",
    "url": "https://remotive.io/remote-jobs/software-dev/lead-ruby-developer-887838",
    "title": "Lead Ruby Developer",
    "company_name": "Robots & Pencils",
    "category": "Software Development",
    "job_type": "contract",
    "publication_date": "2021-09-12T05:51:11.000Z",
    "candidate_required_location": "North America Only",
    "salary": "",
    "description": "<div class=\"h3\">Company Description</div>\n<p><strong>WE EMBRACE A TALENT-LED CULTURE</strong></p>\n<p><strong>Our work is driven by our team’s desire to be pioneers.</strong></p>\n<p><strong>In 2009, we created Robots &amp; Pencils with the then-contrarian view that mobile would be more transformative than the Internet. Turns out we were right.</strong></p>\n<p><strong>Today, our thinking is rooted in the belief that, in the age of unprecedented technology acceleration, maintaining a competitive advantage requires new strategies and a focus on innovation.</strong></p>\n<p><strong>Our approach has been to create a company designed to follow the talent, allowing us to amass an unfair share of hyper-skilled people who call Robots &amp; Pencils home. A team of people who not only develop innovative solutions to transform businesses, but also create products that have been previously inconceivable.</strong></p>\n<p><strong> </strong></p>\n<p><strong>Our Core Values:</strong></p>\n<ul>\n<li><strong>Strong Work Ethic</strong></li>\n<li>\n<p><strong>Top Drawer</strong></p>\n</li>\n<li>\n<p><strong>Always Learning</strong></p>\n</li>\n<li>\n<p><strong>Heart</strong></p>\n</li>\n<li>\n<p><strong>Discipline</strong></p>\n</li>\n<li>\n<p><strong>Efficacy</strong></p>\n</li>\n</ul>\n<p><strong> </strong></p>\n<p><strong> </strong></p>\n<p><strong>Robots &amp; Pencils offers:</strong></p>\n<p>We care about Talent. Hard stop.</p>\n<p>We do this in many ways, by offering:</p>\n<ul>\n<li>An attractive compensation package</li>\n<li>Excellent benefits Medical, Dental, Vision etc. (reviewed each year for enhancements)</li>\n<li>Paid stat/federal holidays, vacation and sick days</li>\n<li>Flexible paid stat/federal holidays (because we care about what you care about and want to celebrate our culturally diverse team!)</li>\n<li>R&amp;P branded swag</li>\n<li>Parental &amp; adoption leave top up / salary continuance</li>\n</ul>\n<p>But we also know a job isn’t just defined by the above, so we pride ourselves in being a company that also offers: </p>\n<ul>\n<li>A #FollowTheTalent mentality -- meaning you can be located anywhere in North America and work remotely. (We have 10+ years of experience building virtual working environments #WeKnowWhatWereDoing)</li>\n<li>A dynamic, fast-paced environment where we’re #alwayslearning.</li>\n<li>And lastly, a team that cares about you and wants to drive the talent experience. How do we do this? Over the years we’ve hosted comedian shows, had holiday parties, happy hours, brunches with the CEO, surprise coffee runs for the team, health &amp; wellness events and prizes, trivia nights, surprise dinners for R&amp;P team members and their family and so much more! And yes, we’ve prioritized a way to do these things in a virtual setting and not just in person - thank you Zoom!</li>\n</ul>\n<p><br><br></p>\n<div class=\"h3\">Job Description</div>\n<p><strong>You are someone who prefers to communicate through code. You love to create and have a strong desire to learn. You have strong opinions but that are weakly held; you are humble yet confident.</strong></p>\n<p><strong>You know the difference between PUT and PATCH, when to use Cassandra over Redis, and can debate the merits of the CAP theorem. You’re not bound to any one framework; you code in different languages and know the advantages and tradeoffs between threaded parallelization and single threaded event loops. You’re also diligent about meeting allocated budgets and can work within time constraints, but you will never sacrifice quality.</strong></p>\n<p><strong>What you'll do:</strong></p>\n<ul>\n<li>\n<p><strong>Work on Client products as well as our own products, delivering first-class software</strong></p>\n</li>\n<li>\n<p><strong>Build out mobile APIs and web applications for mobile and browser Clients</strong></p>\n</li>\n<li>\n<p><strong>Peer review other team members’ code, and learn and adapt from peer review of your own code</strong></p>\n</li>\n<li>\n<p><strong>You leverage your own knowledge to teach and mentor other team members</strong></p>\n</li>\n<li>\n<p><strong>Support sales and project managers with technical insights, leading to the creation of budgets and schedules for projects</strong></p>\n</li>\n</ul>\n<p><br><br></p>\n<div class=\"h3\">Qualifications</div>\n<ul>\n<li><strong>10+ years of delivering software with preference given to those who have a degree in Computer Science/Engineering, or equivalent</strong></li>\n<li>\n<p><strong>Fluent understanding of standard Rails methodology and best practices</strong></p>\n</li>\n<li>\n<p><strong>Required skills </strong></p>\n<ul>\n<li>\n<p><strong>Rails upgrades from Rails 4</strong></p>\n</li>\n<li>\n<p><strong>Ruby upgrades from 2.4</strong></p>\n</li>\n<li>\n<p><strong>Rake</strong></p>\n</li>\n</ul>\n</li>\n<li>\n<p><strong>Knowledge of Active Admin and related customizations</strong></p>\n</li>\n<li>\n<p><strong>Heroku experience and knowledge in Vue.js</strong></p>\n</li>\n<li>\n<p><strong>Knowledge of Javascript and front-end frameworks</strong></p>\n</li>\n<li>\n<p><strong>Robust knowledge of some or all of the following preferred: JavaScript, Node.js, AWS, Elasticsearch, PostgreSQL, Redis, Docker, Cassandra, Git, Client-side JavaScript, and CSS frameworks and tooling</strong></p>\n</li>\n<li>\n<p><strong>Advanced experience in software development design patterns and methodologies</strong></p>\n</li>\n<li>\n<p><strong>Proven working experience in software development and able to mentor peers</strong></p>\n</li>\n<li>\n<p><strong>Ability to take responsibility with testing and behaviour driven development</strong></p>\n</li>\n<li>\n<p><strong>Excellent communications skills with the ability to share insights and expectations with Clients, stakeholders and colleagues, both locally and remotely</strong></p>\n</li>\n</ul>\n<p><br><br></p>\n<div class=\"h3\">Additional Information</div>\n<p><strong>Robots &amp; Pencils aspires to have a workforce that is representative of the diversity of our country and encourages applications from everyone.</strong></p>\n"
  },
  {
    "_id": "613f8896c1c0b3646447b0c2",
    "url": "https://remotive.io/remote-jobs/product/product-manager-891020",
    "title": "Product Manager",
    "company_name": "FairHQ",
    "category": "Product",
    "job_type": "full_time",
    "publication_date": "2021-09-12T05:53:33.000Z",
    "candidate_required_location": "UK and Europe",
    "salary": "",
    "description": "<p><strong>About us</strong></p>\n<p><strong>Fair HQ is the first tech platform</strong> to help startups, scale-ups and VCs <strong>embed diversity &amp; inclusion across their businesses and remove bias</strong> from their processes &amp; behaviours. Some of our customers have called Fair HQ their \"Head of D&amp;I\", which we find both rewarding &amp; fitting. We're an early-stage startup backed by prominent London VCs and amazing tech founders.</p>\n<p>We exist because the world we’re living in today is not (yet) fair — someone's background &amp; identity still influence how they're able to navigate the world of work. We're here to change that. Join us on our mission to create a truly meritocratic society. We're Fair (it's in the name!) — we won't judge you on your background, but on your passion, skills and experience.</p>\n<p><strong>About the role</strong></p>\n<p>As our first product manager, you will be evolving and executing our product vision - helping our customers become more successful through embedding D&amp;I across their organisations. You will be connecting dots from all domains - behavioural science, design, customer development &amp; success, product development, data science and many more.</p>\n<p>We are a fully remote team that periodically meet in person in cool cities across the UK &amp; Europe. Your typical day will consist of a mix of Zoom/Around calls with our team and customers, focused thinking time, and shared collaboration using online tools.</p>\n<p><strong>What you’ll be doing:</strong></p>\n<ul>\n<li><strong>Product strategy</strong> - You'll lead our product vision, strategy, and roadmap for Fair HQ customers, working closely with Kate (CEO &amp; Founder), Bibi (Head of Behavioural Science) and Tracy (CTO).</li>\n<li><strong>Customer development</strong> - You’ll expand understanding of our customers, their jobs to be done, pains &amp; untapped opportunities on the journey to embed diversity &amp; inclusion across their business.</li>\n<li><strong>Ruthless prioritisation</strong> - You'll be in charge of making sure we're solving the most important customer problems.</li>\n<li><strong>Scope &amp; ship solutions, fast!</strong> - You’ll partner with your colleagues from different domains - design, engineering &amp; behavioural science to create and scope product solutions to their smallest coherent state to ship to customers as early as we can.</li>\n<li><strong>Measure impact</strong> - You’ll constantly evaluate whether our solutions have solved the intended problems through quantitative and qualitative measures.</li>\n<li><strong>Quality Assurance</strong> - You’ll own and maintain the quality of the product; deliver world-class software in every release.</li>\n<li><strong>Team spirit</strong> - You’ll motivate a group of committed, smart people to do the best work of their careers.</li>\n</ul>\n<p><strong>Requirements</strong></p>\n<p><strong>What will help you do the job well</strong></p>\n<ul>\n<li><strong>Strategic thinker</strong> — you love connecting the dots and seeing the bigger picture. You enjoy solving complex problems at scale.</li>\n<li><strong>Efficient executor</strong> - You make a plan, break things down into small chunks and execute it flawlessly and quickly while bringing other people on board. You're always ruthlessly prioritising to focus only on the high impact.</li>\n<li><strong>Super organiser</strong> — you see beauty in bringing order to everything, ideally working on many things at the same time. You're always thinking, '<em>How can we do this better?'</em> You never drop the ball.</li>\n<li><strong>People person</strong> - you love interacting with people and building relationships - with your team as well as with customers. Most importantly, you care deeply about them and do your best to make them successful.</li>\n<li><strong>Fast learner</strong> - constantly learning new things brings you excitement and fulfilment. Rather than relying on hand-holding, you love to figure things out from scratch. You thrive in a fast-paced environment, otherwise, you get bored.</li>\n</ul>\n<p><em>IMPORTANT: please apply even if you don't have experience with all of the above. We're happy for you to learn on the job.</em></p>\n<div class=\"h3\"> </div>\n<div class=\"h3\">Diversity at Fair HQ</div>\n<p>We're committed to hiring diversely at Fair HQ. We're very lucky to have people from a huge variety of backgrounds on our team. Diversity brings a wealth of perspectives, experience and creativity to our work. We encourage members of underrepresented groups to apply to this role.</p>\n<p><em>We've taken care to craft a hiring process where candidates are judged on their unique talent and aptitude, not their identity. That's why we: </em></p>\n<ul>\n<li>Don't ask for your CV</li>\n<li>Use work samples to assess your skills</li>\n<li>Go for skills-based interviews rather than assessing 'culture fit'</li>\n</ul>\n<p><strong>Benefits</strong></p>\n<p><strong>What we offer</strong></p>\n<ul>\n<li>💸 Salary is <strong>£55,000-75,000/year</strong> for UK-based employees. The exact salary will be decided according to your experience, it is negotiable.</li>\n<li>🚀 Employee stock options - get a piece of the company success you help to create (after probation)</li>\n<li>🐙 Flexible &amp; remote working</li>\n<li>💻 MacBook</li>\n<li>🎧 Remote home-working set up (using <a class=\"external\" href=\"https://www.hofy.co/\" rel=\"nofollow\">HOFY</a>) or access to part-time hotdesking in your location (after probation, but can be agreed on earlier if needed)</li>\n<li>🏝 30 days of holidays incl. UK bank holidays + plenty of paid leave options (see our full <a class=\"external\" href=\"https://www.notion.so/Holidays-paid-time-off-policy-046586e3828e49758923a787a5099beb\" rel=\"nofollow\">Holidays &amp; paid time off policy </a>)</li>\n<li>🤓 Personal development plan: access to tools, books and people</li>\n<li>🍝 Fascinating lunch &amp; learns with experts in the industry</li>\n<li>🌆 Team retreats in cool locations such as Lisbon, Amsterdam &amp; Prague</li>\n<li>🩺 Private health insurance or online GP service up to £35/month - (after probation)</li>\n<li>💪 Other benefits tailored to your needs</li>\n<li>🎁 Some surprise presents throughout the year</li>\n</ul>\n"
  },
  {
    "_id": "613f8896c1c0b3646447b0bb",
    "url": "https://remotive.io/remote-jobs/devops/portfolio-solution-architect-for-devops-automation-883736",
    "title": "Portfolio Solution Architect for DevOps & Automation",
    "company_name": "Nordcloud Global",
    "category": "DevOps / Sysadmin",
    "job_type": "full_time",
    "publication_date": "2021-09-12T05:54:36.000Z",
    "candidate_required_location": "EU only",
    "salary": "",
    "description": "<p>When you join Nordcloud, you become part of a rapidly growing company, where you will set your career on track for outstanding achievement within a company that knows no limits. Our customers are large enterprises seeking to supercharge their digital transformation with the power of cloud and to benefit from the ability to innovate faster than ever.</p>\n<p>We are looking for a <strong>Portfolio Solutioning Architect in our DevOps &amp; Automation</strong> offering area, responsible for growing our business by working closely with Sales and Delivery teams to bring the best Nordcloud has to offer into the hands of our clients. The DevOps &amp; Automation offering is on a mission to let our clients leverage the full potential of the cloud to optimize their time to value and operations.</p>\n<p><strong>Your daily work:</strong></p>\n<ul>\n<li>You lead or contribute to solutioning complex client challenges utilizing your deep knowledge of DevOps &amp; Automation across all hyperscalers.</li>\n<li>You write crisp proposals which explain the value Nordcloud offers in clear language.</li>\n<li>You give inspiring pitches in front of clients and actively listen for their wants &amp; needs.</li>\n<li>You work with our practice &amp; product leaders to identify the right tailoring and extension of their content for market success.</li>\n<li>You proactively support our offering &amp; product leaders in setting roadmap priorities.</li>\n<li>You kick-start and coach our delivery teams in key engagements to follow through on our value promise.</li>\n</ul>\n<p><strong>To be successful in this role, you should have:</strong></p>\n<ul>\n<li>Several years of experience in contributing to complex proposals and presenting to clients, from early stages to closing. You apply a challenger approach to solution sales in order to initiate and lead customer dialogue with business and IT stakeholders.</li>\n<li>Several years of hands-on, cloud-focused experience in one or more of the following areas: \n<ul>\n<li>CI/CD technologies, </li>\n<li>Observability &amp; monitoring technologies, or </li>\n<li>automation technologies.</li>\n</ul>\n</li>\n<li>Expertise in Infrastructure as Code.</li>\n<li>An understanding and passion for increasing and sharing the knowledge of modern cloud-native technologies and how they can empower DevOps teams.</li>\n<li>Be fluent in discussing Agile methods &amp; frameworks like SAFe, Scrum, and Kanban, and how to unlock value through automation.</li>\n<li>Are trusted by your customers to deliver what you promise and provide valuable insight and solutions that have an impact on their business.</li>\n<li>Strong leadership and collaboration skills.</li>\n<li>Be a team player and target-oriented.</li>\n<li>Structured and analytical way of working.</li>\n<li>Excellent communication skills in English and readiness to travel (subject to covid).</li>\n</ul>\n<p><strong>Why Nordcloud as your next career move?</strong></p>\n<ul>\n<li>In this role, you will be in a key position in developing new business and driving productized services for our DevOps &amp; Automation offering </li>\n<li>Lots of opportunities to develop your expertise and for professional growth. You get access to relevant training &amp; knowledge sharing sessions to support the growth and work with a community of leading cloud professionals. We grow together in our learning community! </li>\n<li>We have 200+ certified AWS experts, 100+ certified Azure experts, and 70+ certified Google Cloud experts working from 20 different offices in 10 European countries, friendly colleagues comprising 30+ nationalities.</li>\n<li>We are continuously developing our business – which means we're not stuck with the attitude of doing things as they've always been done.</li>\n<li>Flexible working hours and freedom to choose your tools and ways of working.</li>\n<li>Wide range of benefits like private health care, certificates paid, wellness &amp; public transportation benefits, high-end laptop and a smartphone of your choice, etc.</li>\n<li>Events &amp; fun – besides all your interesting work assignments, feel free to enjoy our extra-curricular activities such as clubs, virtual coffees, after work, etc. And of course, we welcome new activities open-heartedly if you have anything in mind!</li>\n</ul>\n<p>To get more insight into the daily life at Nordcloud community, check out our <a href=\"https://nordcloud.com/community-culture\" rel=\"nofollow\">Community &amp; Culture site</a>, <a href=\"https://www.instagram.com/nordcloudcommunity\" rel=\"nofollow\">Instagram profile</a>, <a href=\"https://www.facebook.com/nordcloud\" rel=\"nofollow\">Facebook</a> and<a href=\"https://www.linkedin.com/company/nordcloud-ltd/\" rel=\"nofollow\"> LinkedIn</a>. </p>\n<p>Please read our <a href=\"https://nordcloud.com/privacy-policy/\" rel=\"nofollow\">Data Privacy Policy</a> before applying. All applicants <strong>must have the right to work in the EU.</strong></p>\n<p><strong>About Nordcloud</strong></p>\n<p>Nordcloud is a European leader in cloud implementation, application development, managed services, and training. It's a recognized <strong>cloud-native pioneer</strong> with a proven track record helping organizations leverage the public cloud in a way that balances quick wins, immediate savings, and sustainable value. As well as partnering with VMware, Nordcloud is triple-certified across Microsoft Azure, Google Cloud Platform, and Amazon Web Services – and is featured in Gartner's Magic Quadrant. Nordcloud has 10 European hubs, over 500 employees and has delivered over 1,000 successful cloud projects for companies ranging from mid-size to large corporates. IBM <a href=\"https://newsroom.ibm.com/2020-12-21-IBM-to-Acquire-Nordcloud-to-Turbocharge-Its-Hybrid-Cloud-Consulting-Capability\" rel=\"nofollow\" target=\"_blank\">announced</a> its acquisition of Nordcloud on December 21, 2020.</p>\n<p>#NordcloudCommunity </p>\n"
  }
]
